// Да се направи функция, която "разшифрова" скрито съобщение.

// Съобщението представлява двоичен файл с неизвестна дължина. Това, което съхранява е поредица от цели неотрицателни числа.

// "Ключът" за съобщението се съхранява в друг двоичен файл и представлява число в интервала [0, 255]. Преценете как е най-подходящо да прочетете и съхраните ключа.

// Шифърът за получаване на правилното съобщение е към всяко число от прочетения файл, съдържащ съобщението да се добави стойността на прочетения ключ

// Пояснение: ако файлът със скритото съобщение след прочитане изглежда така: 23 48 3 12 4006

// А файлът, съдържащ ключа има стойност 2,

// то разшифрованото съобщение трябва да е: 25 50 5 14 4008

// Изведете разшифрованото съобщение на конзолата.

// Пояснение 2: функцията ви трябва да има следната сигнатура

// 	void decypherMessage(const char* rawMessageFileName, const char* keyFileName )

#include <iostream>
#include <fstream>

int main()
{

  return 0;
}